#include <stdio.h> // ใช้สำหรับแสดงผลลัพธ์บนหน้าจอ

int main() {

    // ทดสอบการใช้เครื่องหมาย % ในการแสดงผลค่าตัวเลข

    printf("a= 0.617 %%\n"); // แสดงว่า a มีค่า 0.617 และมีเครื่องหมายเปอร์เซ็นต์

    printf("b= 25 %%\n");     // แสดงว่า b มีค่า 25 พร้อมเครื่องหมาย %

    printf("c =19.000 %%\n"); // แสดงว่า c เท่ากับ 19.000%

    printf("d  =9  %%\n");      // d มีค่าเป็น 9 ตามด้วยเครื่องหมาย %

    printf("e=124.555 %%\n");// e มีค่า 124.555 ตามด้วยเครื่องหมาย %

    printf("f=0.001 %%\n"); // f มีค่า 0.0001 แล้วต่อด้วย %

    return 0; // คืนค่า 0 เพื่อบอกว่าโปรแกรมทำงานเสร็จสมบูรณ์
}
