#include <stdio.h>



int main() {

    // ข้อมูลผู้ใช้ 3 คน (ใส่ไว้ก่อนหน้า)

    char name1[] = "koi"; // ประกาศตัวแปร name

    int age1 = 18; // ประกาศตัวเเปรอายุโดยใช้ตัวเลข

    int height1 = 170; // ประกาศส่วนสูงโดยใช้ตัวเลข

    float weight1 = 69.9; //ประกาศน้ำหนักโดยใช้ตัวเลข(ทศนิยม1ตำเเหน่ง)

    char grade1 = 'B'; //ประกาศเกรดเฉลี่ยโดยใช้ตัวเลข(ทศนิยม2ตำเเหน่ง)


    char name2[] = "mymint"; // ประกาศตัวแปร name

    int age2 = 18; // ประกาศตัวเเปรอายุโดยใช้ตัวเลข

    int height2 = 154; // ประกาศส่วนสูงโดยใช้ตัวเลข

    float weight2 = 54.0; //ประกาศน้ำหนักโดยใช้ตัวเลข(ทศนิยม1ตำเเหน่ง)

    char grade2 = 'C'; //ประกาศเกรดเฉลี่ยโดยใช้ตัวเลข(ทศนิยม2ตำเเหน่ง)


    char name3[] = "wan"; // ประกาศตัวแปร name

    int age3 = 18; // ประกาศตัวเเปรอายุโดยใช้ตัวเลข

    int height3 = 176; // ประกาศส่วนสูงโดยใช้ตัวเลข

    float weight3 = 50.0; //ประกาศน้ำหนักโดยใช้ตัวเลข(ทศนิยม1ตำเเหน่ง)
 
    char grade3 = 'A'; //ประกาศเกรดเฉลี่ยโดยใช้ตัวเลข(ทศนิยม2ตำเเหน่ง)



    // แสดงผลข้อมูลเป็นตาราง

    printf("\n-------------------------------------------------------------\n");

    printf("| Name    | Age | Height(cm) | Weight(kg) |  Grade Point  |\n");

    printf("-------------------------------------------------------------\n");

    printf("| %-7s | %3d |     %3d     |    %5.1f   |     %4c     |\n", name1, age1, height1, weight1, grade1);

    printf("| %-7s | %3d |     %3d     |    %5.1f   |     %4c     |\n", name2, age2, height2, weight2, grade2);

    printf("| %-7s | %3d |     %3d     |    %5.1f   |     %4c     |\n", name3, age3, height3, weight3, grade3);

    printf("-------------------------------------------------------------\n");



    return 0;
}